Revit 2024 API
RegenerationOption Enumeration
 All regeneration options supported by Revit external commands and external applications.
Namespace: Autodesk.Revit.Attributes
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2011
Syntax
C#
public enum RegenerationOption
Visual Basic
Public Enumeration RegenerationOption
Visual C++
public enum class RegenerationOption
Members
Member name | Description
Manual |  The API framework will not regenerate after every model level change. Instead, you may use the regeneration APIs to force update of the document after a group of changes. SuspendUpdating blocks are unnecessary and should not be used. Performance of multiple modifications of the Revit document should be faster than RegenerationOption.Automatic. Because this mode suspends all updates to the document, your application should not read data from the document after it has been modified until the document has been regenerated, or it runs the risk of accessing stale data. This mode will be only option in a future release.
See Also
Autodesk.Revit.Attributes Namespace